perfomance/jmeter/AUS-JMS-AMQ-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">4988</stringProp>
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="filename">..\data\Test.csv</stringProp>
          <stringProp name="variableNames">ORDER_ID</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <JMSSampler guiclass="JMSSamplerGui" testclass="JMSSampler" testname="JMS Point-to-Point" enabled="true">
          <stringProp name="JMSSampler.queueconnectionfactory">ConnectionFactory</stringProp>
          <stringProp name="JMSSampler.SendQueue">Q.REQ</stringProp>
          <intProp name="JMSSampler.communicationStyle">0</intProp>
          <boolProp name="JMSSampler.isNonPersistent">false</boolProp>
          <boolProp name="JMSSampler.useReqMsgIdAsCorrelId">true</boolProp>
          <boolProp name="JMSSampler.useResMsgIdAsCorrelId">true</boolProp>
          <stringProp name="JMSSampler.timeout">2000</stringProp>
          <stringProp name="HTTPSamper.xml_data">${MQ_CONTENT}</stringProp>
          <stringProp name="JMSSampler.initialContextFactory">org.apache.activemq.jndi.ActiveMQInitialContextFactory</stringProp>
          <stringProp name="JMSSampler.contextProviderUrl">tcp://amq01.apexadev.bridge2solutions.net:61616</stringProp>
          <elementProp name="JMSSampler.jndiProperties" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="queue.Q.REQ" elementType="Argument">
                <stringProp name="Argument.name">queue.Q.REQ</stringProp>
                <stringProp name="Argument.value">AUS.applegr.update.dev</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <elementProp name="arguments" elementType="JMSProperties">
            <collectionProp name="JMSProperties.properties"/>
          </elementProp>
        </JMSSampler>
        <hashTree>
          <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell PreProcessor" enabled="true">
            <stringProp name="parameters">${ORDER_ID}</stringProp>
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">String orderId = bsh.args[0];
int randomId = new java.util.Random().nextInt(100000);
String expectedMessage = &quot;&lt;?xml version=\&quot;1.0\&quot; encoding=\&quot;UTF-8\&quot;?&gt;\n&quot; +
            &quot;&lt;ns2:PlatformUpdateMessage xmlns:ns2=\&quot;http://api.order.service.b2s.com/platformupdate/\&quot;&gt;\n&quot; +
            &quot;   &lt;partnerOrderNumber&gt;&quot;+orderId+&quot;-APPLEGR-&quot;+randomId+&quot;&lt;/partnerOrderNumber&gt;\n&quot; +
            &quot;   &lt;merchantOrderNumber&gt;&quot;+orderId+&quot;&lt;/merchantOrderNumber&gt;\n&quot; +
            &quot;   &lt;updateType&gt;BACKORDER&lt;/updateType&gt;\n&quot; +
            &quot;   &lt;gatewayOrderNumber&gt;&quot;+orderId+&quot;-AQ-8656-1-&quot;+randomId+&quot;&lt;/gatewayOrderNumber&gt;\n&quot; +
            &quot;   &lt;orderLines&gt;\n&quot; +
            &quot;      &lt;lineNumber&gt;1&lt;/lineNumber&gt;\n&quot; +
            &quot;      &lt;backorderInfo /&gt;\n&quot; +
            &quot;      &lt;attributes&gt;\n&quot; +
            &quot;         &lt;name&gt;ShipsBy&lt;/name&gt;\n&quot; +
            &quot;         &lt;value&gt;5–7 business days&lt;/value&gt;\n&quot; +
            &quot;      &lt;/attributes&gt;\n&quot; +
            &quot;      &lt;attributes&gt;\n&quot; +
            &quot;         &lt;name&gt;DeliversBy&lt;/name&gt;\n&quot; +
            &quot;         &lt;value /&gt;\n&quot; +
            &quot;      &lt;/attributes&gt;\n&quot; +
            &quot;   &lt;/orderLines&gt;\n&quot; +
            &quot;&lt;/ns2:PlatformUpdateMessage&gt;&quot;;
vars.put(&quot;MQ_CONTENT&quot;,expectedMessage);</stringProp>
          </BeanShellPreProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">graphResults</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">viewResultsTree</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>